app/Controllers/PropertyController.php

public function fetchHotProperties() {
    $propertyModel = new PropertyModel();
    $properties = $propertyModel->getHotProperties();

    // Create a model for property_images if you don't already have one
    $propertyImagesModel = new PropertyImageModel();

    foreach ($properties as &$property) {
        // Fetch the first image for each property
        $image = $propertyImagesModel->where('property_id', $property['id'])
                                     ->first();
---
SELECT *
FROM `property_images`
WHERE `property_id` = '43'
 LIMIT 1