app/Models/PropertyModel.php

    public function getHotProperties() {
        return $this->select('id, title, interior_size, view_count, address, rooms, type, bathrooms, garages')
                    ->orderBy('view_count', 'DESC')
                    ->limit(3)
                    ->findAll();
---
SELECT `id`, `title`, `interior_size`, `view_count`, `address`, `rooms`, `type`, `bathrooms`, `garages`
FROM `properties`
ORDER BY `view_count` DESC